uploads/xml/Travelport-Request-6666b472bef4d-8357.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:common_v51_0="http://www.travelport.com/schema/common_v51_0" xmlns:univ="http://www.travelport.com/schema/universal_v51_0" TargetBranch="P3763969" TraceId="0b41711e086764c13948744562c235da">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v51_0" OriginApplication="UAPI"/>
      <air:AirItinerary>
        <air:AirSegment ProviderCode="1G" Key="5fVsL/K3nDKAGTNIxjAAAA==" Group="0" Carrier="AZ" FlightNumber="897" Origin="CAI" Destination="FCO" DepartureTime="2024-06-10T17:55:00.000+03:00" ArrivalTime="2024-06-10T20:30:00.000+02:00" FlightTime="215" Distance="1329" ETicketability="Yes" Equipment="32Q" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Cached status used. Polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="Q" AvailabilityDisplayType="Fare Shop/Optimal Shop">
          <air:Connection/>
        </air:AirSegment>
        <air:AirSegment ProviderCode="1G" Key="5fVsL/K3nDKAITNIxjAAAA==" Group="0" Carrier="AZ" FlightNumber="64" Origin="FCO" Destination="MAD" DepartureTime="2024-06-10T21:25:00.000+02:00" ArrivalTime="2024-06-10T23:59:00.000+02:00" FlightTime="154" Distance="836" ETicketability="Yes" Equipment="32Q" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="Cached status used. Polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="Q" AvailabilityDisplayType="Fare Shop/Optimal Shop"/>
      </air:AirItinerary>
      <air:AirPricingModifiers CurrencyType="SAR"/>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v51_0" Code="ADT" Age="25" BookingTravelerRef="NzIwMDA2MDY2NjY2YjQ3MjNkOTE5OC45MzM3NjMwMw=="/>
      <air:AirPricingCommand/>
    </air:AirPriceReq>
  </soapenv:Body>
</soapenv:Envelope>
